#pragma once



class  CFileBuffer
{
public:
	CFileBuffer();
	virtual ~CFileBuffer(void);
	
	/************************************************************************/
	/*功能：初始化设置														*/
	/*参数：szDirName：存放数据的文件夹名称									*/
	/*参数：nMaxDataCount：一个文件最大存储数据条数							*/
	/*参数：nTimeOut：超时切换文件时间										*/
	/*参数：nDataTypeSize：结构体大小										*/
	/*返回值：成功:true, 失败:false											*/
	/************************************************************************/
	virtual bool InitFileBuffer(const char* szDirName="bufferData", 
								int nMaxDataCount=50,
								int nTimeOut=1,
								int nDataTypeSize=1,
								const int nWGNO=0,
								const char *szVersion="00001")=0;

	/************************************************************************/
	/*功能：写数据															*/
	/*参数：data：一次写入的数据缓存										*/
	/*参数：nDataSize：写入数据的大小										*/
	/*返回值：成功true 失败false											*/
	/************************************************************************/
	virtual bool WriteData(const void *data, int nDataSize)=0;

	/************************************************************************/
	/*功能：返回最早文件的所有内容											*/
	/*参数：readData：传入要读取数据的buffer								*/
	/*参数：nToBeRead：传入要读取buffer的大小								*/
	/*返回值：实际读取到的数据大小                                          */
	/************************************************************************/
	virtual int ReadData(void *readData, int nToBeRead)=0;
	
	/************************************************************************/
	/*功能：切换文件														*/
	/*返回值：成功true					                                    */
	/************************************************************************/
	virtual bool SwitchFile()=0;

	/************************************************************************/
	/*功能：获取当前写的文件的数据条数										*/
	/*返回值：当前写的文件的数据条数										*/
	/************************************************************************/
	virtual int GetDataRecordCount()=0;

	/************************************************************************/
	/*功能：获取当初设置一个文件数据最大条数								*/
	/*返回值：一个文件数据最大条数											*/
	/************************************************************************/
	virtual int GetMaxDataCount()=0;
};

/************************************************************************/
/*  CFileBuffer 类工厂													*/
/************************************************************************/
class  CFileBufferFactory
{
public:
	static CFileBuffer* New();
	static void Destroy(CFileBuffer* pBase);
};